# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Isolated development environments using Docker
brew "docker-compose"
# View disk space usage and delete unwanted data, fast
brew "dua-cli"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# Improved top (interactive process viewer)
brew "htop"
# Handy way to save and run project-specific commands
brew "just"
# Source control client
brew "sapling"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Flexible and fast Zsh plugin manager
brew "zinit"
# Shell extension to navigate your filesystem faster
brew "zoxide"

# A nerd font
cask "font-monaspice-nerd-font"

# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
